РазрешенияНаБСП24/src/Catalogs/Клиники/Клиники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Клиники</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>TNT</name>
      <description>CASH SALES MOW</description>
    </items>
  </predefined>
  <attributes>
    <name>НаименованиеТранслит</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлиентскийНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Город</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГородТранслит</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Индекс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>90</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресТранслит</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>90</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Страна</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

РазрешенияНаБСП24/src/Catalogs/КонтактныеЛица/КонтактныеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтактныеЛица</name>
  <owners>Catalog.Клиники</owners>
  <attributes>
    <name>НаименованиеТранслит</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонныйКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

РазрешенияНаБСП24/src/Catalogs/Клиники/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов
// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗагрузитьАдресаИзФайлаДлительнаяОперация(СтруктураПараметров, АдресХранилища) Экспорт
	
	ТекстовыйДокумент 	= СтруктураПараметров.ТекстовыйДокумент;
	КоличествоСтрок 	= ТекстовыйДокумент.КоличествоСтрок();
	
	Для НомерСтроки = 2 По КоличествоСтрок Цикл
		
		Если НомерСтроки % 500 = 0 Тогда
			ДлительныеОперации.СообщитьПрогресс(Цел(НомерСтроки / КоличествоСтрок * 100));
		КонецЕсли;
		
		СтрокаФайла = ТекстовыйДокумент.ПолучитьСтроку(НомерСтроки);
		МассивПодстрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаФайла, ";", , Истина);
		
		Если Не ПроверитьНаличиеОбязательныхПолей(МассивПодстрок, НомерСтроки) Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого Подстрока Из МассивПодстрок Цикл
			Подстрока = СтроковыеФункцииКлиентСервер.СтрокаЛатиницей(Подстрока);	
		КонецЦикла;
		
		Если Не Справочники.Клиники.НайтиПоРеквизиту("НаименованиеТранслит", МассивПодстрок[2]).Пустая() Тогда
			Сообщить("Строка №" + НомерСтроки + " не загружена! Адрес с наименованием """ + МассивПодстрок[2] + """ уже существует!");
			Продолжить;
		КонецЕсли;
		
		Адрес = СоздатьАдрес(МассивПодстрок);
		Если Адрес = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		КонтактноеЛицо = СоздатьКонтактноеЛицо(МассивПодстрок, Адрес.Ссылка);
		Если Адрес = Неопределено Тогда
			Продолжить;
		КонецЕсли;
				
		Адрес.КонтактноеЛицо = КонтактноеЛицо;
		Попытка
			Адрес.Записать();
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Функция ПроверитьНаличиеОбязательныхПолей(МассивПодстрок, НомерСтроки)
	
	Если МассивПодстрок.Количество() < 14 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	МассивОбязательныхПолей = Новый Массив;
	МассивОбязательныхПолей.Добавить(Новый Структура("Индекс, Имя", 2, "Название компании"));
	МассивОбязательныхПолей.Добавить(Новый Структура("Индекс, Имя", 6, "Город"));
	МассивОбязательныхПолей.Добавить(Новый Структура("Индекс, Имя", 11, "Контактное лицо"));
	МассивОбязательныхПолей.Добавить(Новый Структура("Индекс, Имя", 12, "Номер телефона"));
	
	ОбязательныеПоляЗаполнены = Истина;
	Для Каждого ОбязательноеПоле Из МассивОбязательныхПолей Цикл
		Если ПустаяСтрока(МассивПодстрок[ОбязательноеПоле.Индекс]) Тогда
			Сообщить("Строка №" + НомерСтроки + " не загружена! Не заполнено обязательное поле: " + ОбязательноеПоле.Имя);
			ОбязательныеПоляЗаполнены = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ОбязательныеПоляЗаполнены;
	
КонецФункции

Функция СоздатьАдрес(МассивПодстрок)
	
	Адрес = Справочники.Клиники.СоздатьЭлемент();
	
	Адрес.Наименование 			= МассивПодстрок[2];
	Адрес.НаименованиеТранслит 	= Адрес.Наименование;
	Адрес.Адрес 				= МассивПодстрок[3] + МассивПодстрок[4] + МассивПодстрок[5];
	Адрес.АдресТранслит 		= Адрес.Адрес;
	Адрес.ГородТранслит 		= МассивПодстрок[6];
	Адрес.Индекс 				= МассивПодстрок[8];
	Адрес.ИНН 					= МассивПодстрок[10];
	Адрес.Страна 				= Справочники.СтраныМира.Россия;
	
	Попытка
		Адрес.Записать();
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат Адрес;
	
КонецФункции

Функция СоздатьКонтактноеЛицо(МассивПодстрок, Адрес)
	
	КонтактноеЛицо = Справочники.КонтактныеЛица.СоздатьЭлемент();
	
	КонтактноеЛицо.Владелец = Адрес;
	
	КонтактноеЛицо.Наименование 		= МассивПодстрок[11];
	КонтактноеЛицо.НаименованиеТранслит = КонтактноеЛицо.Наименование;
	КонтактноеЛицо.ТелефонныйКод 		= Лев(МассивПодстрок[12], 7);
	КонтактноеЛицо.Телефон 				= Сред(МассивПодстрок[12], 8);
	
	УправлениеКонтактнойИнформациейРазрешения1C.ДобавитьАдресЭлектроннойПочтыКонтактногоЛица(КонтактноеЛицо, МассивПодстрок[13]);
	
	Попытка
		КонтактноеЛицо.Записать();
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат КонтактноеЛицо.Ссылка;
	
КонецФункции

#КонецОбласти


#Область ОбновлениеИнформационнойБазы

Процедура ЗаполнитьПредопределеннойКлиники() Экспорт
	
	//Адрес = Справочники.Клиники.TNT.ПолучитьОбъект();
	//Адрес.НаименованиеТранслит 	= Адрес.Наименование;
	//Адрес.КлиентскийНомер 		= "2659";	
	//Адрес.Город 				= "MOSCOW";
	//Адрес.ГородТранслит 		= "MOSCOW";
	//Адрес.Индекс 				= "123458";
	//Адрес.Адрес 				= "2nd Lykovskaya st., 63";
	//Адрес.АдресТранслит 		= "2nd Lykovskaya st., 63";
	//Адрес.Страна 				= Справочники.СтраныМира.Россия;
	//Адрес.УстановитьНовыйКод();
	//
	//ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Адрес);
	//
	//КонтактноеЛицо = Справочники.КонтактныеЛица.СоздатьЭлемент();
	//КонтактноеЛицо.Владелец 			= Адрес.Ссылка;
	//КонтактноеЛицо.Наименование 		= "Ресепшн";
	//КонтактноеЛицо.НаименованиеТранслит = "Reception";
	//КонтактноеЛицо.ТелефонныйКод 		= "8495";
	//КонтактноеЛицо.Телефон 				= "7972700";
	//КонтактноеЛицо.УстановитьНовыйКод();
	//
	//ОбновлениеИнформационнойБазы.ЗаписатьОбъект(КонтактноеЛицо);
	//
	//Адрес.КонтактноеЛицо = КонтактноеЛицо.Ссылка;
	//
	//ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Адрес);
	
КонецПроцедуры

#КонецОбласти
